Revit 2020 API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
MaterialElementId
Element ID of the material from which this mesh is composed.
NumTriangles
The number of triangles that the mesh contains.
Transformed
Transforms this mesh and returns the result.
Triangle
Retrieves a specific triangle.
Vertices
Retrieves all vertices used to define this mesh. Intended for indexed access.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Mesh Class
Autodesk.Revit.DB Namespace